KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB09.svd
1: DMA mode is enabled</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR_DS_CFG</name>
              <description>OVR_DS_CFG: Down Sampler overrun configuration:

0: the previous data is kept, the new one is lost

1: the previous data is lost, the new one is kept</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_INVERT_SN</name>
              <description>BIT_INVERT_SN: invert bit to bit the ADC data output (1's complement) when a single

negative input is connected to the ADC:

0: no inversion (default)

1: enable the inversion</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_INVERT_DIFF</name>
              <description>BIT_INVERT_DIFF: invert bit to bit the ADC data output (1's complement) when a differential

input is connected to the ADC:

0: no inversion (default)

1: enable the inversion</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_CONT_1V2</name>
              <description>ADC_CONT_1V2: select the input sampling method:

0: sampling only at conversion start (default)

1: sampling starts at the end of conversion</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_RATE_MSB</name>
              <description>SAMPLE_RATE_MSB: Sample Rate MSB

This field is an extension of SAMPLE_RATE definition in bits 12,11 of CONF register. It

impacts the conversion rate of ADC (F_ADC). See SAMPLE_RATE bits for the full description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>CTRL register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>ADC_ON_OFF</name>
              <description>ADC_ON_OFF:

0: power off the ADC

1: power on the ADC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START_CONV</name>
              <description>START_CONV (1): generate a start pulse to initiate an ADC conversion:

0: no effect

1: start the ADC conversion

Note: this bit is set by software and cleared by hardware.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STOP_OP_MODE</name>
              <description>STOP_OP_MODE (1): stop the on-going OP_MODE (ADC mode, Analog audio mode, Full

mode):

0: no effect

1: stop on-going ADC mode

Note: this bit is set by software and cleared by hardware.

When setting the STOP_MODE_OP, the user has to wait around 10 us before to start a new ADC conversion by setting the START_CONV bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TEST_MODE</name>
              <description>TEST_MODE: select the functional or the test mode of the ADC:

0: functional mode (one of the four main functional modes is used)

1: test mode (for debug, test, calibration)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_LDO_ENA</name>
              <description>ADC_LDO_ENA: enable the LDO associated to the ADC block:

0: disable the ADC LDO

1: enable the ADC LDO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWITCH</name>
          <displayName>SWITCH</displayName>
          <description>SWITCH register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SE_VIN_0</name>
              <description>SE_VIN_0[1:0]: input voltage for VINM[0] / VINP[0]-VINM[0]

00: Vinput = 1.2V

01: reserved (not used for this cut)

10: Vinput = 2.4V

11: Vinput = 3.6V</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_1</name>
              <description>SE_VIN_1[1:0]: input voltage for VINM[1] / VINP[1]-VINM[1]

00: Vinput = 1.2V

01: reserved (not used for this cut)

10: Vinput = 2.4V

11: Vinput = 3.6V</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_2</name>
              <description>SE_VIN_2[1:0]: input voltage for VINM[2] / VINP[2]-VINM[2]

00: Vinput = 1.2V

01: reserved (not used for this cut)

10: Vinput = 2.4V

11: Vinput = 3.6V</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_3</name>
              <description>SE_VIN_3[1:0]: input voltage for VINM[3] / VINP[3]-VINM[3]

