KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB09.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <groupName>GPIOA</groupName>
      <baseAddress>0x48000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIOA</name>
        <description>GPIOA interrupt</description>
        <value>15</value>
      </interrupt>
      <registers>
        <register>
          <name>MODER</name>
          <displayName>MODER</displayName>
          <description>MODER register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000A0</resetValue>
          <fields>
            <field>
              <name>MODE0</name>
              <description>MODE0[1:0]Port A configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>MODE1[1:0]Port A configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>MODE2[1:0]Port A configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>MODE3[1:0]Port A configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE8</name>
              <description>MODE8[1:0]Port A configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE9</name>
              <description>MODE9[1:0]Port A configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE10</name>
              <description>MODE10[1:0]Port A configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE11</name>
              <description>MODE11[1:0]Port A configuration bits. These bits are written by software to configure the I/O mode.
-00: Input mode
-01: output mode
-10: Alternate function mode
-11: Analog mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <displayName>OTYPER</displayName>
          <description>OTYPER register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OT0</name>
              <description>OT0: Port A configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT1</name>
              <description>OT1: Port A configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT2</name>
              <description>OT2: Port A configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT3</name>
              <description>OT3: Port A configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT8</name>
              <description>OT8: Port A configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT9</name>
              <description>OT9: Port A configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT10</name>
              <description>OT10: Port A configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT11</name>
              <description>OT11: Port A configuration bits
These bits are written by software to configure the I/O output type.
-0: Output push-pull (reset state)
-1: Output open-drain</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPEEDR</name>
          <displayName>OSPEEDR</displayName>
          <description>OSPEEDR register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>OSPEED0[1:0]: Port A configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>OSPEED1[1:0]: Port A configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>OSPEED2[1:0]: Port A configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>OSPEED3[1:0]: Port A configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED8</name>
              <description>OSPEED8[1:0]: Port A configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED9</name>
              <description>OSPEED9[1:0]: Port A configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED10</name>
              <description>OSPEED10[1:0]: Port A configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED11</name>
              <description>OSPEED11[1:0]: Port A configuration bits
These bits are written by software to configure the I/O output speed.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <displayName>PUPDR</displayName>
          <description>PUPDR register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00550095</resetValue>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>PUPD0: Port A configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD1</name>
              <description>PUPD1: Port A configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD2</name>
              <description>PUPD2: Port A configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD3</name>
              <description>PUPD3: Port A configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD8</name>
              <description>PUPD8: Port A configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD9</name>
              <description>PUPD9: Port A configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD10</name>
              <description>PUPD10: Port A configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD11</name>
              <description>PUPD11: Port A configuration bits
These bits are written by software to configure the I/O pull-up or pull-down
-00: No pull-up, pull-down
-01: Pull-up
-10: Pull-down
-11: Reserved</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>IDR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID0</name>
              <description>ID0:  Port A input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID1</name>
              <description>ID1:  Port A input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID2</name>
              <description>ID2:  Port A input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID3</name>
              <description>ID3:  Port A input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID8</name>
              <description>ID8:  Port A input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID9</name>
              <description>ID9: Port A input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID10</name>
              <description>ID10:  Port A input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID11</name>
              <description>ID11: Port A input data bit.These bits are read-only. They contain the input value of the corresponding I/O port</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <displayName>ODR</displayName>
          <description>ODR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OD0</name>
              <description>OD0:  Port A output data bit
These bits can be read and written by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD1</name>
              <description>OD1:  Port A output data bit
These bits can be read and written by software</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD2</name>
              <description>OD2:  Port A output data bit
These bits can be read and written by software</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD3</name>
              <description>OD3:  Port A output data bit
These bits can be read and written by software</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD8</name>
              <description>OD8:  Port A output data bit
These bits can be read and written by software</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD9</name>
              <description>OD9: Port A output data bit
These bits can be read and written by software</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD10</name>
              <description>OD10:  Port A output data bit
These bits can be read and written by software</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OD11</name>
              <description>OD11: Port A output data bit
These bits can be read and written by software</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
