KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB09.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PKA</name>
      <groupName>PKA</groupName>
      <baseAddress>0x48300000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PKA</name>
        <description>PKA interrupt</description>
        <value>13</value>
      </interrupt>
      <registers>
        <register>
          <name>PKA_CR</name>
          <displayName>PKA_CR</displayName>
          <description>PKA_CR register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Peripheral enable.
0 : Disable PKA.
1 : Enable PKA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Start the operation
0: No operation
1: Writing '1' to this bit starts the operation which is selected by MODE[5:0], using the operands and data
already written to the PKA RAM. This bit is always read as '0'.
Nota: START is ignored if PKA is busy.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECLVL</name>
              <description>Security enable.
0: No side channel countermeasure
1: Square and Multiply always / Double and Add always</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>PKA operation code
000000 : Compute Montgomery parameter and modular exponentiation
000001 : Compute Montgomery parameter
000010 : Compute modular exponentiation only (Montgomery parameter should be loaded)
100000 : Compute Montgomery parameter and compute ECC kP operation
100010 : Compute the ECC kP primitive only (Montgomery parameter should be loaded)
100100 : ECDSA sign
100110 : ECDSA Verification
101000 : Point Check
000111 : RSA CRT exponentiation
001000 : Modular inversion
001001 : Arithmetic addition
001010 : Arithmetic Subtraction
001011 : Arithmetic multiplication
001100 : Comparison
001101 : Modular Reduction
001110 : Modular Addition
001111 : Modular Subtraction
010000 : Montgomery Multiplication</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROCENDIE</name>
              <description>End of operation interrupt enable
0: Interrupt is disabled.
1: An interrupt is generated when PROCENDF (PKA_SR[17]) is set.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERRIE</name>
              <description>RAM error interrupt enable
0: Interrupt is disabled.
1: An interrupt is generated when RAMERRF (PKA_SR[19]) is set.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRERRIE</name>
              <description>Address error interrupt enable
0: Interrupt is disabled.
1: An interrupt is generated when ADDRERRF (PKA_SR[20]) is set.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTFSMIE</name>
              <description>Fault FSM interrupt enable
0: Interrupt is disabled.
1: An interrupt is generated when FAULTFSMF (PKA_SR[22]) is set.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULTERRORCODEIE</name>
              <description>Fault error code interrupt enable
0: Interrupt is disabled.
1: An interrupt is generated when FAULTERRORCODEF (PKA_SR[23]) is set.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_SR</name>
          <displayName>PKA_SR</displayName>
          <description>PKA_SR register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>PKA operation is in progress
This bit is set to '1' whenever START bit in the PKA_CR is set. It is automatically cleared when the computation is complete, meaning that PKA RAM can be safely accessed and a new operation can be started.
0: No operation is in progress (default)
1: An operation is in progress
Nota: if PKA is started with a wrong opcode the IP will be busy for a couple of cycles then it will abort automatically the operation and go back to ready (BUSY bit is set to '0').</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROCENDF</name>
              <description>PKA End of Operation flag
0: Operation in progress
1: PKA operation is completed. This flag is set when the BUSY bit is de-asserted.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAMERRF</name>
              <description>PKA RAM error flag
0: No PKA RAM access error
1: An AHB access to the PKA RAM occured while the PKA core was computing and using its internal RAM (AHB PKA_RAM access are not allowed while PKA operation is in progress).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDRERRF</name>
              <description>Address error flag
0: No Address error
1: Address access is out of range (unmapped address)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULTFSMF</name>
              <description>Fault fsm error flag
0: No fault has been detected
1: A fault on fsm has been detected</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULTERRORCODEF</name>
              <description>Fault error code error flag
0: No fault has been detected
1: A fault has altered the execution of the operation and the internal fault check has been skipped</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKA_CLRFR</name>
          <displayName>PKA_CLRFR</displayName>
          <description>PKA_CLRFR register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROCENDFC</name>
              <description>Clear PKA End of Operation flag
0: No action
1: Clear the PROCENDF flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERRFC</name>
              <description>Clear PKA RAM error flag
0: No action
1: Clear the RAMERRF flag
Bits 18 Reserved, must be kept at zero</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRERRFC</name>
              <description>Clear Address error flag
0: No action
1: Clear the ADDRERRF flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
