KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB09.svd
        <register>
          <name>TRNG_HEALTH_CR</name>
          <displayName>TRNG_HEALTH_CR</displayName>
          <description>TRNG_HEALTH_CR register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02BB0033</resetValue>
          <fields>
            <field>
              <name>REPET_CUTOFF</name>
              <description>Cutoff value of Repetition Test.
The default value is set to 51.
Caution: To be handled with care as any change can lead to misbehavior of TRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADAP_CUTOFF</name>
              <description>Cutoff value of Adaptive Test.
The default value is set to 699.
Caution: To be handled with care as any change can lead to misbehavior of TRNG.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER_ADAP</name>
              <description>Number of iterations minus 1 of Adaptive test during initialization phase. Default value is set to 0 i.e. 1 iteration.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_HEALTH_OSC1_CR</name>
          <displayName>TRNG_HEALTH_OSC1_CR</displayName>
          <description>TRNG_HEALTH_OSC1_CR register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x03E300FB</resetValue>
          <fields>
            <field>
              <name>REPET_CUTOFF_OSC1</name>
              <description>Cutoff value of Repetition Test.
The default value is set to 51.
Caution: To be handled with care as any change can lead to misbehavior of TRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADAP_CUTOFF_OSC1</name>
              <description>Cutoff value of Adaptive Test.
The default value is set to 699.
Caution: To be handled with care as any change can lead to misbehavior of TRNG.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_HEALTH_OSC2_CR</name>
          <displayName>TRNG_HEALTH_OSC2_CR</displayName>
          <description>TRNG_HEALTH_OSC2_CR register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x03E300FB</resetValue>
          <fields>
            <field>
              <name>REPET_CUTOFF_OSC2</name>
              <description>Cutoff value of Repetition Test.
The default value is set to 51.
Caution: To be handled with care as any change can lead to misbehavior of TRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADAP_CUTOFF_OSC2</name>
              <description>Cutoff value of Adaptive Test.
The default value is set to 699.
Caution: To be handled with care as any change can lead to misbehavior of TRNG.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_HEALTH_OSC3_CR</name>
          <displayName>TRNG_HEALTH_OSC3_CR</displayName>
          <description>TRNG_HEALTH_OSC3_CR register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x03E300FB</resetValue>
          <fields>
            <field>
              <name>REPET_CUTOFF_OSC3</name>
              <description>Cutoff value of Repetition Test.
The default value is set to 51.
Caution: To be handled with care as any change can lead to misbehavior of TRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADAP_CUTOFF_OSC3</name>
              <description>Cutoff value of Adaptive Test.
The default value is set to 699.
Caution: To be handled with care as any change can lead to misbehavior of TRNG.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_HEALTH_OSC1_SR</name>
          <displayName>TRNG_HEALTH_OSC1_SR</displayName>
          <description>TRNG_HEALTH_OSC1_SR register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TO1_REPET_ERROR</name>
              <description>Repetition error flag of first oscillator of first triple-oscillator cell.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO1_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of first triple-oscillator cell.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO2_REPET_ERROR</name>
              <description>Repetition error flag of first oscillator of second triple-oscillator cell.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO2_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of second triple-oscillator cell.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO3_REPET_ERROR</name>
              <description>Repetition error flag of first oscillator of third triple-oscillator cell.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO3_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of third triple-oscillator cell.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_HEALTH_OSC2_SR</name>
          <displayName>TRNG_HEALTH_OSC2_SR</displayName>
          <description>TRNG_HEALTH_OSC2_SR register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TO1_REPET_ERROR</name>
              <description>Repetition error flag of first oscillator of first triple-oscillator cell.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO1_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of first triple-oscillator cell.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO2_REPET_ERROR</name>
              <description>Repetition error flag of first oscillator of second triple-oscillator cell.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO2_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of second triple-oscillator cell.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO3_REPET_ERROR</name>
              <description>Repetition error flag of first oscillator of third triple-oscillator cell.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO3_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of third triple-oscillator cell.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_HEALTH_OSC3_SR</name>
          <displayName>TRNG_HEALTH_OSC3_SR</displayName>
          <description>TRNG_HEALTH_OSC3_SR register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TO1_REPET_ERROR</name>
              <description>Repetition error flag of third oscillator of first triple-oscillator cell.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO1_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of first triple-oscillator cell.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO2_REPET_ERROR</name>
              <description>Repetition error flag of first oscillator of second triple-oscillator cell.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO2_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of second triple-oscillator cell.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO3_REPET_ERROR</name>
              <description>Repetition error flag of first oscillator of third triple-oscillator cell.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO3_ADAPT_ERROR</name>
              <description>Adaptive error flag of first oscillator of third triple-oscillator cell.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_IRQ_CR</name>
          <displayName>TRNG_IRQ_CR</displayName>
          <description>TRNG_IRQ_CR register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN_FF_FULL_IRQ</name>
              <description>Enable the interrupt when the output fifo is full of new random.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_ERROR_IRQ</name>
              <description>Enable the interrupt when an error is reported by the health tests.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_IRQ_SR</name>
          <displayName>TRNG_IRQ_SR</displayName>
          <description>TRNG_IRQ_SR register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FF_FULL_IRQ</name>
              <description>Set to 1 when the output fifo is full of new random. Flag is cleared by writing a 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERROR_IRQ</name>
              <description>Set to 1 when an error is reported by the health tests. Flag is cleared by writing a 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
