KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB09.svd
This 5-bit field defines the base-address for DMA transfers (when read/write access are

done through the TIMx_DMAR address). DBA is defined as an offset starting from the

address of the TIMx_CR1 register.

Example:

00000: TIMx_CR1,

00001: TIMx_CR2,

00010: Reserved,

...

Example: Let us consider the following transfer: DBL = 7 transfers and DBA = TIMx_CR1. In

this case the transfer is done to/from 7 registers starting from the TIMx_CR1 address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBL</name>
              <description>DBL[4:0]: DMA burst length

This 5-bit field defines the length of DMA transfers (the timer recognizes a burst transfer when

a read or a write access is done to the TIMx_DMAR address), i.e. the number of transfers.

Transfers can be in half-words or in bytes (see example below).

00000: 1 transfer,

00001: 2 transfers,

00010: 3 transfers,

...

10001: 18 transfers.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <displayName>DMAR</displayName>
          <description>DMAR register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAB</name>
              <description>DMAB[15:0]: DMA register for burst accesses

A read or write operation to the DMAR register accesses the register located at the address

(TIMx_CR1 address) + (DBA + DMA index) x 4

where TIMx_CR1 address is the address of the control register 1, DBA is the DMA base

address configured in TIMx_DCR register, DMA index is automatically controlled by the

DMA transfer, and ranges from 0 to DBL (DBL configured in TIMx_DCR).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <displayName>AF1</displayName>
          <description>AF1 register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKINE</name>
              <description>BKINE: BRK BKIN enable.

This bit enables the BKIN alternate function input for the timer's BRK input. BKIN input is

ORed with the other enabled BRK sources.

0: BKIN input disabled.

1: BKIN input enabled.

Note: This bit can not be modified as long as LOCK level 1 has been programmed (LOCK

bits in TIMx_BDTR register)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKCMP1E</name>
              <description>BKCMP1E: BRK COMP1 enable.

This bit enables the COMP1 for the timer's BRK input. COMP1 output is ORed with the other

enabled BRK sources.

0: COMP1 input disabled.

1: COMP1 input enabled.

Note: This bit can not be modified as long as LOCK level 1 has been programmed (LOCK

bits in TIMx_BDTR register)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKCMP2E</name>
              <description>BKCMP1E: BRK COMP1 enable.

This bit enables the COMP1 for the timer's BRK input. COMP1 output is ORed with the other

enabled BRK sources.

0: COMP1 input disabled.

1: COMP1 input enabled.

Note: This bit can not be modified as long as LOCK level 1 has been programmed (LOCK

bits in TIMx_BDTR register)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF1_8_3</name>
              <description>AF1[13:12]

Not used in Blue51. Not available in IUM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKINP</name>
              <description>BKINP: BRK BKIN input polarity.

This bit selects the BKIN alternate function input sensitivity. It must be programmed together

with the BKP polarity bit.

0: BKIN input is active low.

1: BKIN input is active high.

Note: This bit can not be modified as long as LOCK level 1 has been programmed (LOCK

bits in TIMx_BDTR register)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKCMP1P</name>
              <description>BKCMP1P: BRK COMP1 input polarity.

This bit selects the COMP1 input sensitivity. It must be programmed together with the BKP

polarity bit.

0: COMP1 input is active low.

1: COMP1 input is active high.

Note: This bit can not be modified as long as LOCK level 1 has been programmed (LOCK

bits in TIMx_BDTR register)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKCMP2P</name>
              <description>BKCMP2P: BRK COMP2 input polarity.

This bit selects the COMP2 input sensitivity. It must be programmed together with the BKP

polarity bit.

0: COMP2 input is active low.

1: COMP2 input is active high.

Note: This bit can not be modified as long as LOCK level 1 has been programmed (LOCK

bits in TIMx_BDTR register)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF1_13_12</name>
              <description>AF1[13:12]

Not used in Blue51. Not available in IUM</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL</name>
          <displayName>TISEL</displayName>
          <description>TISEL register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>TI1SEL</name>
              <description>selects TI1[0] to TI1[15] input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
