KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB09.svd
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>CR2 register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLVEN</name>
              <description>SLVEN: Synchronous Slave mode enable
When the SLVEN bit is set, the synchronous slave mode is enabled.
-0: Slave mode disabled.
-1: Slave mode enabled.
Note: When SPI slave mode is not supported, this bit is reserved and must be kept at reset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_NSS</name>
              <description>DIS_NSS
When the DSI_NSS bit is set, the NSS pin input will be ignored.
-0: SPI slave selection depends on NSS input pin.
-1: SPI slave will be always selected and NSS input pin will be ignored.
Note: When SPI slave mode is not supported, this bit is reserved and must be kept at reset value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDM7</name>
              <description>ADDM7:7-bit Address Detection/4-bit Address Detection
This bit is for selection between 4-bit address detection or 7-bit address detection.
-0: 4-bit address detection
-1: 7-bit address detection (in 8-bit data mode)
This bit can only be written when the USART is disabled (UE=0)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBDL</name>
              <description>LBDL: LIN break detection length
This bit is for selection between 11 bit or 10 bit break detection.
-0: 10-bit break detection
-1: 11-bit break detection
This bit can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBDIE</name>
              <description>LBDIE: LIN break detection interrupt enable
Break interrupt mask (break detection using break delimiter).
-0: Interrupt is inhibited
-1: An interrupt is generated whenever LBDF=1 in the USART_ISR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LBCL</name>
              <description>LBCL: Last bit clock pulse
This bit is used to select whether the clock pulse associated with the last data bit transmitted (MSB)
has to be output on the SCLK pin in synchronous mode.
-0: The clock pulse of the last data bit is not output to the SCLK pin
-1: The clock pulse of the last data bit is output to the SCLK pin
Caution: The last bit is the 7th or 8th or 9th data bit transmitted depending on the 7 or 8 or 9 bit
format selected by the M bit in the USART_CR1 register.
This bit can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPHA</name>
              <description>CPHA: Clock phase
This bit is used to select the phase of the clock output on the SCLK pin in synchronous mode. It
works in conjunction with the CPOL bit to produce the desired clock/data relationship (see
Figure 137 and Figure 138)
-0: The first clock transition is the first data capture edge
-1: The second clock transition is the first data capture edge
This bit can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>CPOL: Clock polarity
This bit allows the user to select the polarity of the clock output on the SCLK pin in synchronous
mode. It works in conjunction with the CPHA bit to produce the desired clock/data relationship
-0: Steady low value on SCLK pin outside transmission window
-1: Steady high value on SCLK pin outside transmission window
This bit can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKEN</name>
              <description>CLKEN: Clock enable
This bit allows the user to enable the SCLK pin.
-0: SCLK pin disabled
-1: SCLK pin enabled
This bit can only be written when the USART is disabled (UE=0).
Note: If neither synchronous mode nor Smartcard mode is supported, this bit is reserved and forced
by hardware to 0'. Please refer to Section 23.4: USART implementation on page 483.
Note: In Smartcard mode, in order to provide correctly the SCLK clock to the smartcard, the steps
below must be respected:
UE = 0
SCEN = 1
GTPR configuration
CLKEN= 1
UE = 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP[1:0]: STOP bits
These bits are used for programming the stop bits.
-00: 1 stop bit
-01: 0.5 stop bit.
-10: 2 stop bits
-11: 1.5 stop bits
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINEN</name>
              <description>LINEN: LIN mode enable
This bit is set and cleared by software.
-0: LIN mode disabled
-1: LIN mode enabled
The LIN mode enables the capability to send LIN Synch Breaks (13 low bits) using the SBKRQ bit
in the USART_CR1 register, and to detect LIN Sync breaks.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP</name>
              <description>SWAP: Swap TX/RX pins
This bit is set and cleared by software.
-0: TX/RX pins are used as defined in standard pinout
-1: The TX and RX pins functions are swapped. This allows to work in the case of a cross-wired
connection to another UART.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXINV</name>
              <description>RXINV: RX pin active level inversion
This bit is set and cleared by software.
-0: RX pin signal works using the standard logic levels (VDD =1/idle, Gnd=0/mark)
-1: RX pin signal values are inverted. ((VDD =0/mark, Gnd=1/idle).
This allows the use of an external inverter on the RX line.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXINV</name>
              <description>TXINV: TX pin active level inversion
This bit is set and cleared by software.
-0: TX pin signal works using the standard logic levels (VDD =1/idle, Gnd=0/mark)
-1: TX pin signal values are inverted. ((VDD =0/mark, Gnd=1/idle).
This allows the use of an external inverter on the TX line.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAINV</name>
              <description>DATAINV: Binary data inversion
This bit is set and cleared by software.
-0: Logical data from the data register are send/received in positive/direct logic. (1=H, 0=L)
-1: Logical data from the data register are send/received in negative/inverse logic. (1=L, 0=H). The
parity bit is also inverted.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBFIRST</name>
              <description>MSBFIRST: Most significant bit first
This bit is set and cleared by software.
-0: data is transmitted/received with data bit 0 first, following the start bit.
-1: data is transmitted/received with the MSB (bit 7/8) first, following the start bit.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABREN</name>
              <description>ABREN: Auto baud rate enable
This bit is set and cleared by software.
-0: Auto baud rate detection is disabled.
-1: Auto baud rate detection is enabled.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABRMOD</name>
              <description>ABRMOD[1:0]: Auto baud rate mode
These bits are set and cleared by software.
-00: Measurement of the start bit is used to detect the baud rate.
-01: Falling edge to falling edge measurement. (the received frame must start with a single bit = 1 -&gt;
Frame = Start10xxxxxx)
-10: 0x7F frame detection.
-11: 0x55 frame detection
This bit field can only be written when ABREN = 0 or the USART is disabled (UE=0).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTOEN</name>
              <description>RTOEN: Receiver timeout enable
This bit is set and cleared by software.
-0: Receiver timeout feature disabled.
-1: Receiver timeout feature enabled.
When this feature is enabled, the RTOF flag in the USART_ISR register is set if the RX line is idle
(no reception) for the duration programmed in the RTOR (receiver timeout register).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>ADD[7:0]: Address of the USART node
This bit-field gives the address of the USART node or a character code to be recognized.
This is used in multiprocessor communication during Mute mode or Stop mode, for wakeup with 7-
bit address mark detection. The MSB of the character sent by the transmitter should be equal to 1.
It may also be used for character detection during normal reception, Mute mode inactive (for
example, end of block detection in ModBus protocol). In this case, the whole received character (8-
bit) is compared to the ADD[7:0] value and CMF flag is set on match.
This bit field can only be written when reception is disabled (RE = 0) or the USART is disabled
(UE=0)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
