KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB09.svd
        <register>
          <name>AGC18_DIG_ENG</name>
          <displayName>AGC18_DIG_ENG</displayName>
          <description>AGC18_DIG_ENG register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003C</resetValue>
          <fields>
            <field>
              <name>ATT_IF_8</name>
              <description>Attenuation at IF Level for the AGC step 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_8</name>
              <description>Attenuation at LNA Level for the AGC step 8</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_8</name>
              <description>Attenuation at Antenna Level for the AGC step 8</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC19_DIG_ENG</name>
          <displayName>AGC19_DIG_ENG</displayName>
          <description>AGC19_DIG_ENG register</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003D</resetValue>
          <fields>
            <field>
              <name>ATT_IF_9</name>
              <description>Attenuation at IF Level for the AGC step 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_LNA_9</name>
              <description>Attenuation at LNA Level for the AGC step 9</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATT_ANT_9</name>
              <description>Attenuation at Antenna Level for the AGC step 9</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXADC_HW_TRIM_OUT</name>
          <displayName>RXADC_HW_TRIM_OUT</displayName>
          <description>RXADC_HW_TRIM_OUT register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>HW_RXADC_DELAYTRIM_I</name>
              <description>control bits of the RX ADC loop delay for I channel (provided by the HW trimming, automatically loaded on POR).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_RXADC_DELAYTRIM_Q</name>
              <description>control bits of the RX ADC loop delay for Q channel (provided by the HW trimming, automatically loaded on POR).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBIAS0_HW_TRIM_OUT</name>
          <displayName>CBIAS0_HW_TRIM_OUT</displayName>
          <description>CBIAS0_HW_TRIM_OUT register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000088</resetValue>
          <fields>
            <field>
              <name>HW_CBIAS_IBIAS_TRIM</name>
              <description>CBIAS current (provided by the HW trimming, automatically loaded on POR).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_CBIAS_IPTAT_TRIM</name>
              <description>CBIAS current (provided by the HW trimming, automatically loaded on POR).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_HW_TRIM_OUT</name>
          <displayName>AGC_HW_TRIM_OUT</displayName>
          <description>AGC_HW_TRIM_OUT register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>HW_AGC_ANTENNAE_TRIM</name>
              <description>AGC trim value (provided by the HW trimming, automatically loaded on POR).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOD_IQ2_DIG_TST</name>
          <displayName>DEMOD_IQ2_DIG_TST</displayName>
          <description>DEMOD_IQ2_DIG_TST register</description>
          <addressOffset>0x23c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTCFG_SAMPLING_TIME</name>
              <description>Defines the sampling time, when extended configuration is enabled: 
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTCFG_TRIG_SELECTION</name>
              <description>Defines the trigger/anchor point of the IQ sampling, when extended configuration is enabled: 
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSW0_DIG_USR</name>
          <displayName>ANTSW0_DIG_USR</displayName>
          <description>ANTSW0_DIG_USR register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000001C</resetValue>
          <fields>
            <field>
              <name>RX_TIME_TO_SAMPLE</name>
              <description>specifies the exact timing of the first I/Q sampling in the reference period.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSW1_DIG_USR</name>
          <displayName>ANTSW1_DIG_USR</displayName>
          <description>ANTSW1_DIG_USR register</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>RX_TIME_TO_SWITCH</name>
              <description>specifies the exact timing of the antenna switching at receiver level (in AoA).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSW2_DIG_USR</name>
          <displayName>ANTSW2_DIG_USR</displayName>
          <description>ANTSW2_DIG_USR register</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000029</resetValue>
          <fields>
            <field>
              <name>TX_TIME_TO_SWITCH</name>
              <description>specifies the exact timing of the antenna switching during transmission at LE_1M baud rate (in AoD).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSW3_DIG_USR</name>
          <displayName>ANTSW3_DIG_USR</displayName>
          <description>ANTSW3_DIG_USR register</description>
          <addressOffset>0x24c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000023</resetValue>
          <fields>
            <field>
              <name>TX_TIME_TO_SWITCH_2M</name>
              <description>specifies the exact timing of the antenna switching during transmission at LE_2M baud rate (in AoD).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
